# ShadowIntensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..ShadowIntensity Property
View Class See Also
---
The intesity of cast shadows - 0 = no shadows, 100 = black.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int ShadowIntensity { get; set; }
```

Visual Basic
---
```text
Public Property ShadowIntensity As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ShadowIntensity {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The value is invalid. The valid range is 0 through 100 |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This view does not contain display-related properties. |

# See Also
View Class
Autodesk.Revit.DB Namespace